ideaboard-api/app/controllers/api/v1/ideas_controller.rb

    def index
      @ideas = Idea.order("created_at DESC")
---
SELECT "ideas".* FROM "ideas" ORDER BY created_at DESC

    def create
      @idea = Idea.create(idea_params)
---
INSERT INTO "ideas" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", ""], ["body", ""], ["created_at", "2019-07-08 07:38:24.379286"], ["updated_at", "2019-07-08 07:38:24.379286"]]

    def update
      @idea = Idea.find(params[:id])
      @idea.update_attributes(idea_params)
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 18], ["LIMIT", 1]]
UPDATE "ideas" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "ideas"."id" = ?  [["title", "tu"], ["body", "asasa\n"], ["updated_at", "2019-07-08 10:38:36.967070"], ["id", 24]]

    def destroy
      @idea = Idea.find(params[:id])
      if @idea.destroy
---
SELECT  "ideas".* FROM "ideas" WHERE "ideas"."id" = ? LIMIT ?  [["id", 24], ["LIMIT", 1]]
DELETE FROM "ideas" WHERE "ideas"."id" = ?  [["id", 24]]